# AlmostEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..AlmostEqual Method
Transform Class See Also
---
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool AlmostEqual(
	Transform right
)
```

Visual Basic
---
```text
Public Function AlmostEqual ( _
	right As Transform _
) As Boolean
```

Visual C++
---
```text
public:
bool AlmostEqual(
	Transform^ right
)
```

# ### Parameters
right
    Type: Autodesk.Revit.DB..::..TransformThe transformation to compare with this transformation.
# ### Return Value
True if the two transformations are equal; otherwise, false.
# Remarks
The tolerance is applied memberwise for comparison.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the specified transformation is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Transform Class
Autodesk.Revit.DB Namespace